In [213]:
# Dataquest to familiarize myself with python, pandas and matplotlib

In [214]:
import pandas as pd

In [215]:
import matplotlib.pyplot as plt

In [216]:
import seaborn as sns

In [217]:
sns.set(style="darkgrid")

In [218]:
file = pd.read_csv('fortune500.csv')

In [219]:
file.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

In [220]:
file.tail()

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [221]:
#Rename columns to our liking so we can refer to them.
file.columns=['year','rank','company','revenue','profit']

In [222]:
file.head()

   year  rank           company  revenue profit
0  1955     1    General Motors   9823.5    806
1  1955     2       Exxon Mobil   5661.4  584.8
2  1955     3        U.S. Steel   3250.4  195.4
3  1955     4  General Electric   2959.1  212.6
4  1955     5            Esmark   2510.8   19.1

In [223]:
# Lenght of file 25500 records one each line
len(file)

25500

In [224]:
# check file datatypes for each columns
file.dtypes

year         int64
rank         int64
company     object
revenue    float64
profit      object
dtype: object

In [225]:
# We have a problem with the profit column. We need it to be a float64 just like revenue.This indicate they might have non-integer values.

In [226]:
non_numberic_profits = df.profit.str.contains('[^0-9.-]')

In [227]:
file.loc[non_numberic_profits]

       year  rank                company  revenue profit
228    1955   229                 Norton    135.0   N.A.
290    1955   291        Schlitz Brewing    100.0   N.A.
294    1955   295  Pacific Vegetable Oil     97.9   N.A.
296    1955   297     Liebmann Breweries     96.0   N.A.
352    1955   353     Minneapolis-Moline     77.4   N.A.
...     ...   ...                    ...      ...    ...
24242  2003   243    Farmland Industries   7580.2   N.A.
24296  2003   297           Land O'Lakes   5847.0   N.A.
24435  2003   436               Roundy's   3637.9   N.A.
24489  2003   490           Ace Hardware   3029.0   N.A.
25485  2005   486          Host Marriott   3773.0   N.A.

[369 rows x 5 columns]

In [228]:
set(df.profit[non_numberic_profits])

{'N.A.'}

In [229]:
len(df.profit[non_numberic_profits])

369